### Imputasi

Imputasi adalah nilai/data yang hilang (missing value; NaN; blank) dengan nilai pengganti.

Teknik imputasi berdasarkan tipe data, terdiri dari:
1. Tipe data Variabel Numerik, dengan cara:
    - Imputasi mean atau median.
    - Imputasi nilai suka-suka (arbitrary).
    - Imputasi nilai/data ujung (end of tail).
    
2. Tipe data Variabel Kategorik, dengan cara:
    - Imputasi kategori yang sering muncul.
    - Tambah kategori yang hilang.

#### Mean

In [3]:
import pandas as pd
import numpy as np

kolom = {'col1':[2,9,19],
         'col2':[5,np.nan,17],
         'col3':[3,9,np.nan],
         'col4':[6,0,9],
         'col5':[np.nan,7,np.nan]}

data = pd.DataFrame(kolom)

In [4]:
data

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   NaN
1     9   NaN   9.0     0   7.0
2    19  17.0   NaN     9   NaN

In [5]:
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   7.0
1     9  11.0   9.0     0   7.0
2    19  17.0   6.0     9   7.0

#### Nilai Suka-suka (Arbitrary)

In [6]:
umur ={'umur':[29,43,np.nan,25,34,np.nan,50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

Ambil nilai paling jauh (atas atau bawah)

In [7]:
data.fillna(99)

   umur
0  29.0
1  43.0
2  99.0
3  25.0
4  34.0
5  99.0
6  50.0

#### End of Tail (Pilih dari Pojok)

In [8]:
umur ={'umur':[29,43,np.nan,25,34,np.nan,50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [11]:
pip install feature-engine

Requirement already satisfied: feature-engine in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (1.2.0)
Requirement already satisfied: scipy>=1.4.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.8.0)
Requirement already satisfied: statsmodels>=0.11.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (0.13.2)
Requirement already satisfied: pandas>=1.0.3 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.4.0)
Requirement already satisfied: scikit-learn>=0.22.2 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.0.2)
Requirement already satisfied: numpy>=1.18.2 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from feature-engine) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas>=1.0.3->feature-engine) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas>=1.0.3->feature-engine) (2.8.2)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.1.3; however, version 22.0.4 is available.

Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.1->pandas>=1.0.3->feature-engine) (1.16.0)
Requirement already satisfied: joblib>=0.11 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (3.1.0)
Requirement already satisfied: patsy>=0.5.2 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (0.5.2)
Requirement already satisfied: packaging>=21.3 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (21.3)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from packaging>=21.3->statsmodels>=0.11.1->feature-engine) (3.0.7)

You should consider upgrading via the 'c:\users\user\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [13]:
#import EndTailImputer
from feature_engine.imputation import EndTailImputer #ambil imputasi menggunakan end of tail

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian',tail='right') #tail right lebih pas dari left

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#menampilkan data
test_data

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

In [14]:
#import EndTailImputer
from feature_engine.imputation import EndTailImputer #ambil imputasi menggunakan end of tail

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian',tail='left') #tail dari kiri

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#menampilkan data
test_data

        umur
0  29.000000
1  43.000000
2   5.503095
3  25.000000
4  34.000000
5   5.503095
6  50.000000

Bagaimana dengan data kategorikal?
Kita akan gunakan imputasi modus.

#### Modus

In [18]:
from sklearn.impute import SimpleImputer
mobil ={'merk':['Ford','Ford','Toyota','Honda',np.nan,'Toyota','Honda','Toyota',np.nan,np.nan]}

data = pd.DataFrame(mobil)

In [21]:
data

     merk
0    Ford
1    Ford
2  Toyota
3   Honda
4     NaN
5  Toyota
6   Honda
7  Toyota
8     NaN
9     NaN

In [22]:
imputasi = SimpleImputer(strategy='most_frequent')

In [23]:
imputasi.fit_transform(data)

array([['Ford'],
       ['Ford'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Toyota']], dtype=object)

Bagaimana kalau kita butuh untuk mengatasi missing value untuk kategorikal dan numerikal secara bersamaan?
Kita bisa gunakan random sample.

#### Random Sample

In [25]:
#import dulu si Random Sample
from feature_engine.imputation import RandomSampleImputer

#silakan buat data yang ada missing value-nya
data ={'Jenis Kelamin': ['Laki-laki', 'Perempuan', 'Laki-laki', np.nan, 'Laki-laki', 'Perempuan','Perempuan',np.nan,'Laki-laki',np.nan],
        'Umur':[29,np.nan,32,43,50,22,np.nan,52,np.nan,17]}

df = pd.DataFrame(data)

In [26]:
df

  Jenis Kelamin  Umur
0     Laki-laki  29.0
1     Perempuan   NaN
2     Laki-laki  32.0
3           NaN  43.0
4     Laki-laki  50.0
5     Perempuan  22.0
6     Perempuan   NaN
7           NaN  52.0
8     Laki-laki   NaN
9           NaN  17.0

In [27]:
#buat dulu imputer
imputer = RandomSampleImputer(random_state=29)

#fit-kan
imputer.fit(df)

#ubah data
testing_df = imputer.transform(df)

In [28]:
#lihat hasil akhir
testing_df

  Jenis Kelamin  Umur
0     Laki-laki  29.0
1     Perempuan  52.0
2     Laki-laki  32.0
3     Perempuan  43.0
4     Laki-laki  50.0
5     Perempuan  22.0
6     Perempuan  50.0
7     Laki-laki  52.0
8     Laki-laki  22.0
9     Perempuan  17.0